nongxiaoming/DAPLinkTiny/Software/Libraries/hic_hal/at32/at32f415/usbd_AT32F4xx.c
/*
 *  Write USB Device Endpoint Data
 *  If write was requested synchronously from IRQ then data is written to FIFO directly 
 *  else data is written to the intermediate buffer and synchronously transferred to FIFO 
 *  on next NAK event.
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *                     cnt:   Number of bytes to write
 *    Return Value:    Number of bytes written
 */

uint32_t USBD_WriteEP (uint32_t EPNum, uint8_t *pData, uint32_t cnt) {
  uint32_t *ptr, i, isoEpFlag;

  EPNum &= ~(0x80);

  if ((DIEPCTL(EPNum) & (1 << 15)) == 0) return (0); /* if Ep not active      */
  isoEpFlag = (EP_IN_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS);

  /* Asynchronous write to intermediate buffer                                */
  if (!SyncWriteEP && InPacketDataPtr[EPNum]) {
    if ((!(InPacketDataReady & (1 << EPNum))) || isoEpFlag) {
      InPacketDataCnt[EPNum] = cnt;     /* save Data size                     */
      ptr = InPacketDataPtr[EPNum];
      i   = (cnt+3)/4;
      if (i) { 
        while (i--) {                   /* save data to intermediate buffer   */
          *ptr++ = *((__packed uint32_t *)pData);
          pData +=4;
        }
      }
      if (!isoEpFlag) {
        InPacketDataReady |=  1 << EPNum;
        DIEPCTL(EPNum)    |= (1 << 27); /* Set NAK to enable interrupt on NAK */
        OTG->DIEPMSK   |= (1 <<  6);    /* INEPNEM = 1, IN EP NAK efective msk*/
      }
    } else {                            /* If packet already loaded to buffer */
      return 0;
    }
  } else {
    if (cnt) while ((DTXFSTS(EPNum) * 4) < cnt); /* get space in Ep TxFIFO    */

    /* Set transfer size and packet count                                     */
    DIEPTSIZ(EPNum) = cnt | (1 << 19) | (1 << 29); 
                             
    if (isoEpFlag) {                    /* if Isochronous Ep: set packet frame*/
      if (USBD_GetFrame() & 1) DIEPCTL(EPNum) |= (1 << 28); /* even frame     */
      else DIEPCTL(EPNum) |= (1 << 29);                     /* odd frame      */
    }
    
    DIEPCTL(EPNum) |= (1UL << 31) | (1 << 26);  /* enable ep and clear NAK    */
    if (cnt) {
      ptr = (uint32_t *)pData;
      i   = (cnt+3)/4;
      while (i--) {                     /* copy data to endpoint TxFIFO       */
        TX_FIFO(EPNum) = *(__packed uint32_t *)pData;
        pData +=4;
      }
    }
    if (isoEpFlag == 0) InPacketDataReady &= ~(1 << EPNum);
  }
  return (cnt);
}


/*
 *  Get USB Device Last Frame Number
 *    Parameters:      None
 *    Return Value:    Frame Number
 */

uint32_t USBD_GetFrame (void) {
  return ((OTG->DSTS >> 8) & 0x3FFF);
}


/*
 *  USB Device Interrupt Service Routine
 */
//void USBOTG_IRQHandler(void) {
//  uint32_t istr, val, num, i, msk;
//  static uint32_t IsoInIncomplete = 0;

//  istr = OTG->GINTSTS & OTG->GINTMSK;

///* reset interrupt                                                            */
//  if (istr & (1 << 12)) {
//    USBD_Reset();
//    usbd_reset_core();
//#ifdef __RTX
//    if (USBD_RTX_DevTask) {
//      isr_evt_set(USBD_EVT_RESET, USBD_RTX_DevTask);
//    }
//#else
//    if (USBD_P_Reset_Event) {
//      USBD_P_Reset_Event();
//    }
//#endif
//    OTG->GINTSTS = (1 << 12);
//  }

///* suspend interrupt                                                          */
//  if (istr & (1 << 11)) {
//    USBD_Suspend();
//#ifdef __RTX
//    if (USBD_RTX_DevTask) {
//      isr_evt_set(USBD_EVT_SUSPEND, USBD_RTX_DevTask);
//    }
//#else
//    if (USBD_P_Suspend_Event) {
//      USBD_P_Suspend_Event();
//    }
//#endif
//    OTG->GINTSTS = (1 << 11);
//  }

///* resume interrupt                                                           */
//  if (istr & (1UL << 31)) {
//    USBD_Resume();
//#ifdef __RTX
//    if (USBD_RTX_DevTask) {
//      isr_evt_set(USBD_EVT_RESUME, USBD_RTX_DevTask);
//    }
//#else
//    if (USBD_P_Resume_Event) {
//      USBD_P_Resume_Event();
//    }
//#endif
//    OTG->GINTSTS = (1UL << 31);
//  }

///* speed enumeration completed                                                */
//  if (istr & (1 << 13)) {
//    OTG->DIEPCTL0 &= ~3;
//    switch (USBD_MAX_PACKET0) {
//      case 8:
//        OTG->DIEPCTL0 |= 3;
//      break;

//      case 16:
//        OTG->DIEPCTL0 |= 2;
//      break;

//      case 32:
//        OTG->DIEPCTL0 |= 1;
//      break;
//			
//			default:
//				break;
//    }
//    OTG->DCTL    |= (1 << 8);           /* clear global IN NAK                */
//    OTG->DCTL    |= (1 << 10);          /* clear global OUT NAK               */
//    OTG->GINTSTS  = (1 << 13);
//  }

///* Start Of Frame                                                             */
//  if (istr & (1 << 3)) {
//#ifdef __RTX
//    if (USBD_RTX_DevTask) {
//      isr_evt_set(USBD_EVT_SOF, USBD_RTX_DevTask);
//    }
//#else
//    if (USBD_P_SOF_Event) {
//      USBD_P_SOF_Event();
//    }
//#endif
//     OTG->GINTSTS = (1 << 3);
//  }

///* RxFIFO non-empty                                                           */
//  if (istr & (1 << 4)) {
//    val = OTG->GRXSTSR;
//    num = val & 0x0F;

//    switch ((val >> 17) & 0x0F) {
///* setup packet                                                               */
//      case 6:
//#ifdef __RTX
//      OTG->GINTMSK &= ~(1 << 4);
//      if (USBD_RTX_EPTask[num]) {
//        isr_evt_set(USBD_EVT_SETUP, USBD_RTX_EPTask[num]);
//      }
//#else
//      if (USBD_P_EP[num]) {
//        USBD_P_EP[num](USBD_EVT_SETUP);
//      }
//#endif
//      break;

///* OUT packet                                                                 */
//      case 2:
//      OTG->GINTMSK &= ~(1 << 4);
//      if (EP_OUT_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
//        IsoOutTokenRead = 1;
//        USBD_ReadEP (num, (uint8_t *)IsoOutPacketDataPtr[num]);
//        IsoOutTokenRead = 0;
//      } else {
//#ifdef __RTX
//        if (USBD_RTX_EPTask[num]) {
//          isr_evt_set(USBD_EVT_OUT, USBD_RTX_EPTask[num]);
//        }
//#else
//        if (USBD_P_EP[num]) {
//          USBD_P_EP[num](USBD_EVT_OUT);
//        }
//#endif
//      }
//      break;

//      default:
//        OTG->GRXSTSP;
//    }
//  }

///* OUT Packet                                                                 */
//  if (istr & (1 << 19)) {
//    msk = (((OTG->DAINT & OTG->DAINTMSK) >> 16) & 0xFFFF);
//    i   = 0;
//    while (msk) {
//      num = 0;
//      for (; i < (USBD_EP_NUM+1); i++) {
//        if ((msk >> i) & 1) {
//          num = i;
//          msk &= ~(1 << i);
//          break;
//        }
//      }

//      /* Endpoint disabled                                                    */
//      if (DOEPINT(num) & (1 << 1)) {
//        if (EP_OUT_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
//          DOEPTSIZ(num) = (1 << 19) |                /* packet count          */
//                          (OutMaxPacketSize[num]);   /* transfer size         */
//          
//          if ((USBD_GetFrame() & 1)) DOEPCTL(num) |= (1 << 28); /* even frame */
//          else                       DOEPCTL(num) |= (1 << 29); /* odd frame  */

//          DOEPCTL(num)    |= (1UL <<31) | (1 << 26);
//        }
//        DOEPINT(num) |= (1 << 1);
//      }
//      
//      /* Transfer complete interrupt                                          */
//      if ((DOEPINT(num) & 1) | (DOEPINT(num) & (1 << 3))) {
//        if (EP_OUT_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) {

