nongxiaoming/DAPLinkTiny/Software/Libraries/hic_hal/at32/at32f415/usbd_AT32F4xx.c
//          DOEPTSIZ(num)    = (1 << 19) |                 /* packet count      */
//                             (OutMaxPacketSize[num]);    /* transfer size     */
//          if (num == 0) {
//            DOEPTSIZ(0)   |= (1 << 29);
//          }
//          DOEPCTL(num)    |= (1UL <<31) | (1 << 26);     /* clr NAK, en EP    */
//        }
//        DOEPINT(num) |= 1;
//      }
//    }
//  }

///* IN Packet                                                                  */
//  if (istr & (1 << 18)) {
//    msk = (OTG->DAINT & OTG->DAINTMSK & 0xFFFF);
//    i   = 0;
//    while (msk) {
//      num = 0;
//      for (; i < (USBD_EP_NUM+1); i++) {
//        if ((msk >> i) & 1) {
//          num = i;
//          msk &= ~(1 << i);
//          break;
//        }
//      }

//      /* Endpoint disabled                                                    */
//      if (DIEPINT(num) & (1 << 1)) {
//        DIEPINT(num) = (1 << 1);
//        
//        if (EP_IN_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
//          if ((IsoInIncomplete & (1 << num)) != 0) {

//            USBD_FlushInEpFifo(num | 0x80);
//            SyncWriteEP = 1;
//            USBD_WriteEP (num, (uint8_t *)InPacketDataPtr[num], InPacketDataCnt[num]);
//            SyncWriteEP = 0;

//            IsoInIncomplete &= ~(1 << num);
//          }
//        }
//      }

//      /* IN endpoint NAK effective                                            */
//      if (DIEPINT(num) & (1 << 6)) {
//        if (EP_IN_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) {
//          if (InPacketDataPtr[num] && (InPacketDataReady & (1 << num))) {
//            SyncWriteEP = 1;
//            USBD_WriteEP (num, (uint8_t *)InPacketDataPtr[num], InPacketDataCnt[num]);
//            SyncWriteEP = 0;
//            if (!InPacketDataReady)     /* No more pending IN transfers       */
//              OTG->DIEPMSK &= ~(1 << 6);/* Disable IN NAK interrupts          */
//            continue;
//          } else 
//              DIEPCTL(num) |= (1 << 26);
//            DIEPINT(num)    = (1 <<  6);
//        }
//      }

//      /* Transmit completed                                                   */
//      if (DIEPINT(num) & 1) {
//        DIEPINT(num) = 1;
//        SyncWriteEP = 1;
//        if (EP_IN_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
//          USBD_WriteEP (num, (uint8_t *)InPacketDataPtr[num], InPacketDataCnt[num]);
//        } else {
//#ifdef __RTX
//          if (USBD_RTX_EPTask[num]) {
//            isr_evt_set(USBD_EVT_IN,  USBD_RTX_EPTask[num]);
//          }
//#else
//          if (USBD_P_EP[num]) {
//            USBD_P_EP[num](USBD_EVT_IN);
//          }
//#endif
//        }
//        SyncWriteEP = 0;
//      }
//    }
//  }

///* End of periodic frame                                                      */
//  if (istr & (1 << 15)) {
//    for (num = 1; num <= USBD_EP_NUM; num++) {

//      if (EP_OUT_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) continue;
//      if (((DOEPCTL(num) >> 15) & 1) == 0)                   continue;

//      /* incomplete isochronous out transfer                                  */
//      if (OTG->GINTSTS & (1 << 21)) {
//        if ((USBD_GetFrame() & 1) == ((DOEPCTL(num) >> 16) & 1)) {
//          if (DOEPCTL(num) & (1UL << 31)) {
//            InPacketDataCnt[num] = 0;   /* discard data                       */
//            DOEPCTL(num) |= (1UL << 30);/* disable endpoint                   */
//          }
//        }

//      /* prepare for next isohronous transfer                                 */
//      } else {
//        DOEPTSIZ(num) = (1 << 19) |                /* packet count            */
//                        (OutMaxPacketSize[num]);   /* transfer size           */

//        if ((USBD_GetFrame() & 1)) DOEPCTL(num) |= (1 << 28); /* even frame   */
//        else                       DOEPCTL(num) |= (1 << 29); /* odd frame    */

//        DOEPCTL(num)    |= (1UL <<31) | (1 << 26);
//      }
//    }
//    OTG->GINTSTS = (1 << 15) | (1 << 21);
//  }

///* incomplete isochronous IN transfer                                         */
//  if (istr & (1 << 20)) {
//    OTG->GINTSTS = (1 << 20);
//    for (num = 1; num < (USBD_EP_NUM + 1); num++) {

//      if (EP_IN_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) continue;
//      if (((DIEPCTL(num) >> 15) & 1) == 0)                  continue;

//      if (DIEPCTL(num) & (1UL << 31)) { /* if EP en & packet frame is incorect*/
//        if ((USBD_GetFrame() & 1) == ((DIEPCTL(num) >> 16) & 1)) {
//          
//          IsoInIncomplete |= (1 << num);
//          DIEPCTL(num)    |= (1UL << 30) | (1 << 27);
//        }
//      }
//    }
//  }
//}
#define ISTR_RESUME        (0x01UL<<31)
#define ISTR_INCOMISOIN    (0x01UL<<20)
#define ISTR_OEPTINT       (0x01UL<<19)
#define ISTR_IEPTINT       (0x01UL<<18)
#define ISTR_RESET         (0x01UL<<12)
#define ISTR_SUSP          (0x01UL<<11)
#define ISTR_SOF           (0x01UL<<3)

void USBD_Handler(void)
{
    U32 istr, num, val, num_val;
    cortex_int_state_t state;

    // Get ISTR
    state = cortex_int_get_and_disable();
    istr = LastIstr;
    LastIstr = 0;
    cortex_int_restore(state);

    /* USB Reset Request                                                        */
    if (istr & ISTR_RESET) {
        USBD_Reset();
        usbd_reset_core();
#ifdef __RTX

        if (USBD_RTX_DevTask) {
            isr_evt_set(USBD_EVT_RESET, USBD_RTX_DevTask);
        }

#else

        if (USBD_P_Reset_Event) {
            USBD_P_Reset_Event();
        }

#endif
    }

    /* USB Suspend Request                                                      */
    if (istr & ISTR_SUSP) {
        USBD_Suspend();
#ifdef __RTX

        if (USBD_RTX_DevTask) {
            isr_evt_set(USBD_EVT_SUSPEND, USBD_RTX_DevTask);
        }

#else

        if (USBD_P_Suspend_Event) {
            USBD_P_Suspend_Event();
        }

#endif
    }

    /* USB Wakeup                                                               */
    if (istr & ISTR_RESUME) {
        //USBD_WakeUp();
			  USBD_Resume();
#ifdef __RTX

        if (USBD_RTX_DevTask) {
            isr_evt_set(USBD_EVT_RESUME,  USBD_RTX_DevTask);
        }

#else

        if (USBD_P_Resume_Event) {
            USBD_P_Resume_Event();
        }

#endif
    }

    /* Start of Frame                                                           */
    if (istr & ISTR_SOF) {
#ifdef __RTX

        if (USBD_RTX_DevTask) {
            isr_evt_set(USBD_EVT_SOF, USBD_RTX_DevTask);
        }

#else

        if (USBD_P_SOF_Event) {
            USBD_P_SOF_Event();
        }

#endif
    }

    /* PMA Over/underrun                                                        */
    if (istr & ISTR_PMAOVR) {
#ifdef __RTX
        LastError = 2;

        if (USBD_RTX_DevTask) {
            isr_evt_set(USBD_EVT_ERROR, USBD_RTX_DevTask);
        }

#else

        if (USBD_P_Error_Event) {
            USBD_P_Error_Event(2);
        }

#endif
    }

    /* Error: No Answer, CRC Error, Bit Stuff Error, Frame Format Error         */
    if (istr & ISTR_ERR) {
#ifdef __RTX
        LastError = 1;

        if (USBD_RTX_DevTask) {
            isr_evt_set(USBD_EVT_ERROR, USBD_RTX_DevTask);
        }

#else

        if (USBD_P_Error_Event) {
            USBD_P_Error_Event(1);
        }

#endif
    }

    /* Endpoint Interrupts                                                      */
    while ((istr & ISTR_CTR) && !stat_is_empty()) {
        num_val = stat_deque();
        num = (num_val >> EP_NUM_SHIFT) & EP_NUM_MASK;
        val = (num_val >> VAL_SHIFT) & VAL_MASK;
        if (val & EP_CTR_TX) {
#ifdef __RTX

            if (USBD_RTX_EPTask[num]) {
                isr_evt_set(USBD_EVT_IN,  USBD_RTX_EPTask[num]);
            }

#else

            if (USBD_P_EP[num]) {
                USBD_P_EP[num](USBD_EVT_IN);
            }

#endif
        }

        if (val & EP_CTR_RX) {
#ifdef __RTX

            if (USBD_RTX_EPTask[num]) {
                isr_evt_set((val & EP_SETUP) ? USBD_EVT_SETUP : USBD_EVT_OUT, USBD_RTX_EPTask[num]);
            }

#else

            if (USBD_P_EP[num]) {
                USBD_P_EP[num]((val & EP_SETUP) ? USBD_EVT_SETUP : USBD_EVT_OUT);
            }

#endif
        }
    }
}
